# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Working with JSON files

Import the pandas library

In [61]:
# Your import here:
import pandas as pd
import wget

####  After importing pandas, let's find a dataset. In this lesson we will be working with a NASA dataset.

Run the code in the cell below to load the dataset containing information about asteroids that have landed on earth. This piece of code helps us open the URL for the dataset and deocde the data using UTF-8.

In [13]:
# Run this code

from urllib.request import urlopen
import json

response = urlopen("https://data.nasa.gov/resource/y77d-th95.json")
json_data = response.read().decode('utf-8', 'replace')

In the next cell, load the data in `json_data` and load it into a pandas dataframe. Name the dataframe `nasa`.

In [14]:
# Your code here:

nasa = pd.read_json(json_data, orient = 'records')
print(nasa)

          name     id nametype               recclass      mass  fall  \
0       Aachen      1    Valid                     L5      21.0  Fell
1       Aarhus      2    Valid                     H6     720.0  Fell
2         Abee      6    Valid                    EH4  107000.0  Fell
3     Acapulco     10    Valid            Acapulcoite    1914.0  Fell
4      Achiras    370    Valid                     L6     780.0  Fell
..         ...    ...      ...                    ...       ...   ...
995   Tirupati  24009    Valid                     H6     230.0  Fell
996    Tissint  54823    Valid  Martian (shergottite)    7000.0  Fell
997      Tjabe  24011    Valid                     H6   20000.0  Fell
998   Tjerebon  24012    Valid                     L5   16500.0  Fell
999  Tomakovka  24019    Valid                    LL6     600.0  Fell

                        year    reclat    reclong  \
0    1880-01-01T00:00:00.000  50.77500    6.08333
1    1951-01-01T00:00:00.000  56.18333   10.23333
2    1952-01-01T00:00:00.000  54.21667 -113.00000
3    1976-01-01T00:00:00.000  16.88333  -99.90000
4    1902-01-01T00:00:00.000 -33.16667  -64.95000
..                       ...       ...        ...
995  1934-01-01T00:00:00.000  13.63333   79.41667
996  2011-01-01T00:00:00.000  29.48195   -7.61123
997  1869-01-01T00:00:00.000  -7.08333  111.53333
998  1922-01-01T00:00:00.000  -6.66667  106.58333
999  1905-01-01T00:00:00.000  47.85000   34.76667

                                           geolocation  \
0    {'type': 'Point', 'coordinates': [6.08333, 50....
1    {'type': 'Point', 'coordinates': [10.23333, 56...
2    {'type': 'Point', 'coordinates': [-113, 54.216...
3    {'type': 'Point', 'coordinates': [-99.9, 16.88...
4    {'type': 'Point', 'coordinates': [-64.95, -33....
..                                                 ...
995  {'type': 'Point', 'coordinates': [79.41667, 13...
996  {'type': 'Point', 'coordinates': [-7.61123, 29...
997  {'type': 'Point', 'coordinates': [111.53333, -...
998  {'type': 'Point', 'coordinates': [106.58333, -...
999  {'type': 'Point', 'coordinates': [34.76667, 47...

     :@computed_region_cbhk_fwbd  :@computed_region_nnqa_25f4
0                            NaN                          NaN
1                            NaN                          NaN
2                            NaN                          NaN
3                            NaN                          NaN
4                            NaN                          NaN
..                           ...                          ...
995                          NaN                          NaN
996                          NaN                          NaN
997                          NaN                          NaN
998                          NaN                          NaN
999                          NaN                          NaN

[1000 rows x 12 columns]

Now that we have loaded the data, let's examine it using the `head()` function.

In [15]:
# Your code here:
nasa.head(10)

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4
0,Aachen,1,Valid,L5,21.0,Fell,1880-01-01T00:00:00.000,50.77500,6.08333,"{'type': 'Point', 'coordinates': [6.08333, 50....",NaN,NaN
1,Aarhus,2,Valid,H6,720.0,Fell,1951-01-01T00:00:00.000,56.18333,10.23333,"{'type': 'Point', 'coordinates': [10.23333, 56...",NaN,NaN
2,Abee,6,Valid,EH4,107000.0,Fell,1952-01-01T00:00:00.000,54.21667,-113.00000,"{'type': 'Point', 'coordinates': [-113, 54.216...",NaN,NaN
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976-01-01T00:00:00.000,16.88333,-99.90000,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",NaN,NaN
4,Achiras,370,Valid,L6,780.0,Fell,1902-01-01T00:00:00.000,-33.16667,-64.95000,"{'type': 'Point', 'coordinates': [-64.95, -33....",NaN,NaN
5,Adhi Kot,379,Valid,EH4,4239.0,Fell,1919-01-01T00:00:00.000,32.10000,71.80000,"{'type': 'Point', 'coordinates': [71.8, 32.1]}",NaN,NaN
6,Adzhi-Bogdo (stone),390,Valid,LL3-6,910.0,Fell,1949-01-01T00:00:00.000,44.83333,95.16667,"{'type': 'Point', 'coordinates': [95.16667, 44...",NaN,NaN
7,Agen,392,Valid,H5,30000.0,Fell,1814-01-01T00:00:00.000,44.21667,0.61667,"{'type': 'Point', 'coordinates': [0.61667, 44....",NaN,NaN
8,Aguada,398,Valid,L6,1620.0,Fell,1930-01-01T00:00:00.000,-31.60000,-65.23333,"{'type': 'Point', 'coordinates': [-65.23333, -...",NaN,NaN
9,Aguila Blanca,417,Valid,L,1440.0,Fell,1920-01-01T00:00:00.000,-30.86667,-64.55000,"{'type': 'Point', 'coordinates': [-64.55, -30....",NaN,NaN

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [16]:
# Your code here:
nasa['fall'].value_counts()

Fell     996
Found      4
Name: fall, dtype: int64

Finally, let's save the dataframe as a json file again. Since we downloaded the file from an online source, the goal of saving the dataframe is to have a local copy. Save the dataframe using the `orient=records` argument and name the file `nasa.json`.

In [21]:
# Your code here:
nasa.to_json('nasa.json', orient = 'records')

# Challenge 2 - Working with CSV and Other Separated Files

csv files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a csv file into a dataframe directly from a URL without having to load the file first like we did with the JSON URL. The dataset we will be using contains informtaions about NASA shuttles. 

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [33]:
# Run this code:

cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [34]:
# Your code here:
shuttle = pd.read_csv(tst_url, sep=' ', names= ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class'])

    time  rad_flow  fpv_close  fpv_open  high  bypass  bpv_close  bpv_open  \
55     0        81          0        -6    11      25         88        64
56     0        96          0        52    -4      40         44         4
50    -1        89         -7        50     0      39         40         2
53     9        79          0        42    -2      25         37        12
55     2        82          0        54    -6      26         28         2
..   ...       ...        ...       ...   ...     ...        ...       ...
80     0        84          0       -36   -29       4        120       116
55     0        81          0       -20    25      26        102        76
55     0        77          0        12   -22      22         65        42
37     0       103          0        18   -16      66         85        20
56     2        98          0        52     1      42         46         4

    class
55      4
56      4
50      1
53      4
55      1
..    ...
80      5
55      4
55      4
37      1
56      4

[14500 rows x 9 columns]

Let's verify that this worked by looking at the `head()` function.

In [35]:
# Your code here:
shuttle.head(5)

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated and that we are not saving the index column.

In [36]:
# Your code here:

shuttle.to_csv('shuttle.csv', index = False)

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the same folder that contains this notebook. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [45]:
# Your code here:
astronaut = pd.read_excel('astronauts.xls')

Use the `head()` function to inspect the dataframe.

In [46]:
# Your code here:
astronaut.head(5)

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [54]:
# Your code here:

astronaut['Undergraduate Major'].value_counts()

Physics                                    35
Aerospace Engineering                      33
Mechanical Engineering                     30
Aeronautical Engineering                   28
Electrical Engineering                     23
                                           ..
Electronics Engineering                     1
Physics; English                            1
Applied Biology; Mechanical Engineering     1
Industrial Management                       1
Earth Sciences                              1
Name: Undergraduate Major, Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a tab separated file using the `to_csv` function. Call the file `astronaut.csv` and remember to remove the index column.

In [55]:
# Your code here:
austronaut.to_csv('astronaut.csv',sep ='\t',index = False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function.

In [66]:
# Your code here:
url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/00244/fertility_Diagnosis.txt'
save_f = wget.download(url, '/Users/mvillavicencio/Documents/Data Analytics/GIT/GitHub_Repo/data-labs/module-1/lab-import-export/your-code')
f=open("fertility_Diagnosis.txt", "r")
fertility= pd.read_csv("fertility_Diagnosis.txt", sep=',', names=[1,2,3,4,5,6,7,8,9,10])
fertility.head(5)

     1     2   3   4   5   6    7   8     9  10
0 -0.33  0.69   0   1   1   0  0.8   0  0.88  N
1 -0.33  0.94   1   0   1   0  0.8   1  0.31  O
2 -0.33  0.50   1   0   0   0  1.0  -1  0.50  N
3 -0.33  0.75   0   1   1   0  1.0  -1  0.38  N
4 -0.33  0.67   1   1   0   0  0.8  -1  0.50  O